# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Luke Young\Documents\06_Projects\PSOC_Librays\Modbus_RTU_PSOC4\example_projects\Basic_1_Modbus_RTU_PSOC4.cydsn\Basic_1_Modbus_RTU_PSOC4.cyprj
# Date: Tue, 04 Feb 2020 00:55:04 GMT
#set_units -time ns
create_clock -name {USB_UART_SCBCLK(FFB)} -period 708.33333333333326 -waveform {0 354.166666666667} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {MODBUS_TIMER_CLK(FFB)} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {USB_UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 17 35} -nominal_period 708.33333333333326 [list]
create_generated_clock -name {RS485_IntClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/udb_div_0}]]
create_generated_clock -name {MODBUS_TIMER_CLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 24001 48001} [list]


# Component constraints for C:\Users\Luke Young\Documents\06_Projects\PSOC_Librays\Modbus_RTU_PSOC4\example_projects\Basic_1_Modbus_RTU_PSOC4.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Luke Young\Documents\06_Projects\PSOC_Librays\Modbus_RTU_PSOC4\example_projects\Basic_1_Modbus_RTU_PSOC4.cydsn\Basic_1_Modbus_RTU_PSOC4.cyprj
# Date: Tue, 04 Feb 2020 00:55:00 GMT
